#+OPTIONS: ^:nil
**** main program (~main.py~)
#+NAME: main.py
#+BEGIN_SRC python :results output :exports none
import chm_exact
reactions = [0, 1]
data_path = "../../DATA/toy/"
chm_exact.compute_CH(data_path + "toy_reactions.txt", data_path + "toy_stoichs.txt", data_path + "toy_domains.txt", reactions)
#+END_SRC

#+RESULTS: main.py
: R1	R2
: 3	3
: 0	-1
: 0	0
: 3	1
: 1	-1

***** show help
      #+NAME: show-help
      #+BEGIN_SRC shell :results output :exports both
./chm_exact_v2.py -h     
      #+END_SRC

      #+RESULTS: show-help
      #+begin_example
      usage: chm_exact_v2.py [-h] [-m MODEL_LOCATION] [-r REACTION_FILE]
			     [-s STOICHIOMETRIC_FILE] [-b BOUNDARY_FILE]
			     dimensionality

      Calculate projected convex set of given network. Needs either an xml/sbml-
      model or 3 files containing the relevant data.

      positional arguments:
	dimensionality        dimension N onto which convhull shall be projected.

      optional arguments:
	-h, --help            show this help message and exit
	-m MODEL_LOCATION, --model_location MODEL_LOCATION
			      weburl pointing to sbml(xml)-model, can be a filepath
			      too.
	-r REACTION_FILE, --reaction_file REACTION_FILE
			      path to file containing reaction ids line by line.
	-s STOICHIOMETRIC_FILE, --stoichiometric_file STOICHIOMETRIC_FILE
			      path to file containing stoichiometrics of reactions.
	-b BOUNDARY_FILE, --boundary_file BOUNDARY_FILE
			      path to file containing upper and lower bounds.
      #+end_example
***** run with xml
      #+BEGIN_SRC shell :results output :exports both
./chm_exact_v2.py -m ../../DATA/toy/iToy.xml \
		  2
      #+END_SRC

      #+RESULTS:
      #+begin_example
      loaded model:
      ../../DATA/toy/iToy.xml


      initital problem:
      {'rids': ['R1', 'R2', 'R3'], 'domain': [[0, -1, 0], [3, 1000, 2]], 'Aeq': Matrix([[1, -1, -1]]), 'beq': Matrix([[0]])}

      projecting hull onto 2 dimensions.

      created linear problem with qsopt_ex.

      refined convex hull:
      [[[Matrix([[-1, 0, 0]]), 0], Matrix([
      [ 0, 0],
      [-1, 0],
      [ 1, 0]]), 0], [[Matrix([[-1, 1, 0]]), 0], Matrix([
      [3, 0],
      [3, 0],
      [0, 0]]), 0], [[Matrix([[1/3, 0, 0]]), 1], Matrix([
      [3, 3],
      [3, 1],
      [0, 2]]), 0], [[Matrix([[0, -1, 0]]), 1], Matrix([
      [ 1,  0],
      [-1, -1],
      [ 2,  1]]), 0], [[Matrix([[1/2, -1/2, 0]]), 1], Matrix([
      [3,  1],
      [1, -1],
      [2,  2]]), 0]]

      refined set of points:
      Matrix([[3, 0, 0, 3, 1], [3, -1, 0, 1, -1], [0, 1, 0, 2, 2]])

      #+end_example
***** run from separate files
      #+BEGIN_SRC shell :results output :exports both
./chm_exact_v2.py -r ../../DATA/toy/toy_reactions.txt \
		  -s ../../DATA/toy/toy_stoichs.txt \
		  -b ../../DATA/toy/toy_domains.txt \
		  2
      #+END_SRC

      #+RESULTS:
      #+begin_example

      initital problem:
      {'rids': ['R1', 'R2', 'R3'], 'domain': [[0, -1, 0], [3, 1000, 2]], 'Aeq': Matrix([[1, -1, -1]]), 'beq': Matrix([[0]])}

      projecting hull onto 2 dimensions.

      created linear problem with qsopt_ex.

      refined convex hull:
      [[[Matrix([[-1, 0, 0]]), 0], Matrix([
      [ 0, 0],
      [-1, 0],
      [ 1, 0]]), 0], [[Matrix([[-1, 1, 0]]), 0], Matrix([
      [3, 0],
      [3, 0],
      [0, 0]]), 0], [[Matrix([[1/3, 0, 0]]), 1], Matrix([
      [3, 3],
      [3, 1],
      [0, 2]]), 0], [[Matrix([[0, -1, 0]]), 1], Matrix([
      [ 1,  0],
      [-1, -1],
      [ 2,  1]]), 0], [[Matrix([[1/2, -1/2, 0]]), 1], Matrix([
      [3,  1],
      [1, -1],
      [2,  2]]), 0]]

      refined set of points:
      Matrix([[3, 0, 0, 3, 1], [3, -1, 0, 1, -1], [0, 1, 0, 2, 2]])

      #+end_example
